design_model/src/main/resources/面向对象设计原则/Interface Segregation Principle.md
```mermaid
classDiagram
    class Client {
    }
    class CustomerDataDisplay {
        +dataRead()
        +transformToXML()
        +createChart()
        +displayChart()
        +createReport()
        +displayReport()
    }
    note "没有使用接口分离职责过重" for CustomerDataDisplay
    class ConcreteClass {
        +dataRead()
        +transformToXML()
        +createChart()
        +displayChart()
        +createReport()
        +displayReport()
    }
    Client --> CustomerDataDisplay
    ConcreteClass --|> CustomerDataDisplay
    class DataHandler {
        +dataRead()
    }
    class XMLTransformer {
        +transformToXML()
    }
    class ChartHandler {
        +createChart()
        +displayChart()
    }
    class ReportHandler {
        +createReport()
        +displayReport()
    }
    Client2 ..> DataHandler
    Client2 ..> ChartHandler
    ConcreteClass2 --|> DataHandler
    ConcreteClass2 --|> ChartHandler
```
